<template>
   
    <div class="userAgreement">
        <header-fix :active-index="headerIndex"></header-fix>
        <div class="agreement">
            <div class="title">
                终身学习网用户注册协议
            </div>
            <div class="tip">
                在此特别提醒您在注册成为终身学习网用户之前,请认真阅读本《终身学习网用户注册协议》
                (以下简称“协议”),确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。
                您同意并点击确认本协议条款且完成注册程序后,才能成为终身学习网的正式注册用户,并享受终
                身学习网的各类服务。您的注册、登录、使用等行为将视为对本协议的接受,并同意接受本协议各
                项条款的约束。若您不同意本协议,或对本协议中的条款存在任何疑问,请您立即停止终身学习网用
                户注册程序,并可以选择不使用终身学习网服务。本协议条款是杭州精英在线教育科技股份有限公司
                （以下称“精英在线”或“我们”）对用户相关政策的许诺,请您务必仔细阅读。
            </div>
            <div class="con">
                <div class="list">
                    <div class="list-hd">
                        1. <span>用户信息采集</span>  
                    </div>
                    <div class="list-bd">
                        当您在本网站/软件进行用户注册登记，使用本网站/软件的服务，以及参加本网站/软件
                        的活动时，即为您同意本网站/软件将收集您的个人信息，并保存记录。本网站/软件收集
                        的个人信息包括但不限于：姓名、性别、生日、城市、身份证号码、电子邮箱地址、手机
                        电话等。您主动提供的信息越多及越准确，我们就能够更好地为您提供有关服务。
                    </div>
                </div>
                <div class="list">
                    <div class="list-hd">
                        2. <span>用户信息的使用</span> 
                    </div>
                    <div class="list-bd">
                        本网站收集个人信息的基本目的是为了更好的了解我们的用户，以便向您提供特色服务和个性
                        化服务。个人信息将主要用于以下几个目的：
                    </div>
                    <div class="list-ft">
                        <ul>
                            <li>
                                <span>(1)</span>本网站/软件的某些服务需由一个合作伙伴(如代理公司、提供相关技术服务的公
                                司、运输公司、邮寄公司、提供奖品的公司等)提供或共同提供。为了向您提供此类
                                服务，本网站有必要与该合作伙伴分享您的个人信息。如果您不希望您的信息被分享，
                                您可以不使用该具体服务从而拒绝您的个人信息被披露。 
                            </li>
                            <li>
                                <span>(2)</span>本网站/软件可能会与第三方共同进行推广活动。在推广活动中所收集的全部或部
                                分个人信息可能会与该第三方分享。如果您不想让您的信息被分享，您可以通过不参
                                加该推广活动而拒绝。 
                            </li>
                            <li>
                                <span>(3)</span>根据法律法规或政府的强制性规定，我们必须向有关司法或政府部门提供您的个人信息。
                            </li>
                            <li>
                                <span>(4)</span>为了防止他人的合法权益或社会公共利益受到重大危害。 
                            </li>
                            <li><span>(5)</span>为了防止您的合法权益受到重大危害。</li>
                            <li>
                                <span>(6)</span>我们发现您的行为违反了本网站/软件的服务条款或关于特定服务或产品的任何使用
                                 指引， 或对终身学习网信息的合法权益构成重大危害。
                            </li>
                        </ul>
                    </div>
                </div>
                <div class="list">
                    <div class="list-hd">
                        3. <span>用户信息的共享和披露</span> 
                    </div>
                    <div class="list-bd">
                        终身学习网信息所收集您的个人信息，将仅用于终身学习网为您提供相关服务。一般情况下，
                        在未得到您的同意之前，您的任何个人信息将不会被提供给无关的第三方。 在下列情况下，
                        我们可能会将您的个人信息提供给有关的第三方：
                    </div>
                    <div class="list-ft">
                        <ul>
                            <li>
                                <span>(1)</span>本网站/软件的某些服务需由一个合作伙伴(如代理公司、提供相关技术服务的公司、
                                运输公司、邮寄公司、提供奖品的公司等)提供或共同提供。为了向您提供此类服务，本
                                网站有必要与该合作伙伴分享您的个人信息。如果您不希望您的信息被分享，您可以不使
                                用该具体服务从而拒绝您的个人信息被披露。
                            </li>
                            <li>
                                <span>(2)</span>本网站/软件可能会与第三方共同进行推广活动。在推广活动中所收集的全部或部分
                                个人信息可能会与该第三方分享。如果您不想让您的信息被分享，您可以通过不参加该推广活动而拒绝。
                            </li>
                            <li>
                                <span>(3)</span>根据法律法规或政府的强制性规定，我们必须向有关司法或政府部门提供您的个人信息。
                            </li>
                            <li>
                                <span>(4)</span>为了防止他人的合法权益或社会公共利益受到重大危害。
                            </li>
                            <li>
                                <span>(5)</span>为了防止您的合法权益受到重大危害。
                            </li>
                            <li>
                                <span>(6)</span>我们发现您的行为违反了本网站/软件的服务条款或关于特定服务或产品的任何使用指引，
                                 或对终身学习网信息的合法权益构成重大危害。
                            </li>
                        </ul>
                    </div>
                </div>
                <div class="list">
                    <div class="list-hd">
                        4. <span>用户信息的共享和披露</span> 
                    </div>
                    <div class="list-bd">
                        您可以在任何时候通过使用您的本网站/软件的注册用户名和密码，查询，补充或更正您的本网站/软件帐户中的个人信息，
                        或要求删除您的本网站/软件帐户中的个人信息。您在本网站/软件的帐户可以被删除，但这样会导致您不能够登录本网站/软
                        件及使用本网站/软件的任何服务。若发现任何非法使用用户帐号或存在安全漏洞的情况,请立即通知本站并向公安机关报案。
                        因用户未妥善保管其帐号名称及密码而导致第三人使用帐号而给用户造成的损失,由用户自行承担
                    </div>
                    <div class="list-bd">
                        用户在注册及使用时应承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性
                        等七条底线,且用户对其发布的内容(包括但不限于文字、图片等)时,不得有以下情形：
                    </div>
                    <div class="list-ft">
                        <ul>
                            <li>
                                <span>(1)</span>违反宪法或法律法规规定的;
                            </li>
                            <li>
                                <span>(2)</span>危害国家安全,泄露国家秘密,颠覆国家政权,破坏国家统一的;
                            </li>
                            <li>
                                <span>(3)</span>损害国家荣誉和利益的,损害公共利益的;
                            </li>
                            <li>
                                <span>(4)</span>煽动民族仇恨、民族歧视,破坏民族团结;
                            </li>
                            <li>
                                <span>(5)</span>破坏国家宗教政策,宣扬邪教和封建迷信的;
                            </li>
                            <li>
                                <span>(6)</span>散布谣言,扰乱社会秩序,破坏社会稳定的;
                            </li>
                            <li>
                                <span>(7)</span>散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的
                            </li>
                            <li>
                                <span>(8)</span>侮辱或者诽谤他人,侵害他人合法权益的;
                            </li>
                            <li>
                                <span>(9)</span>含有法律、行政法规禁止的其他内容或违反***的其他规定的。
                            </li>
                        </ul>
                    </div>
                    <div class="list-bd">
                        用户以虚假信息骗取帐号名称注册,或其帐号头像、简介等注册信息存在违法和不良信息的,我们有权采取通知限期改正、
                        暂停使用、注销登记等措施。终身学习网帐号仅限于用户本人使用,
                        严禁将您的终身学习网帐号允许第三人使用,否则用户应承担由此产生的全部责任,并与实际使用人承担连带责任。
                    </div>
                </div>
                <div class="list">
                    <div class="list-hd">
                        5.<span>信息安全</span>
                    </div>
                    <div class="list-bd">
                        您的本网站/软件帐户信息和本网站/软件档案通过密码来保护，只有您个人才有权获取这些
                        个人信息。我们建议您不要向任何他人泄露您的密码。本网站/软件也不会主动致电或主动
                        发电子邮件给您来询问您的密码，如果您遇到此类情况请及时与终身学习网客服联系确认。
                        同时，请您在完成工作后，务必退出您的本网站/软件帐户并关闭您的浏览器窗口，以便当您
                        与他人合用一台电脑，或正在公共场所使用电脑时，保证他人无法获取您的个人信息和往来通
                        信。遗憾的是，任何通过互联网或无线网络的数据传输都无法获得绝对的安全保证。所以，
                        在我们尽最大努力来保护您的个人信息的同时，本网站/软件不能对您向我们进行的信息传输，
                        或我们所发的在线产品或服务的信息的安全作出肯定或保证。您作出上述行为时将自己承担风
                        险。一旦我们收到您传输来的信息，我们将尽最大努力保证其在我们系统的安全。
                    </div>
                </div>
                <div class="list">
                    <div class="list-hd">
                        6.<span>用户隐私制度</span>
                    </div>
                    <div class="list-bd">
                       我们会在您自愿的前提下收集您的个人信息并将这些信息进行整合,包括但不限于注册
                        帐号时的相关信息和活动报名信息等。尊重用户个人隐私是终身学习网的一项基本政策。
                        所以,我们不会公开或向任何第三方透露用户的注册资料以及用户因享受终身学习网服务
                        而提供的任何信息,但以下情形除外:
                    </div>
                    <div class="list-ft">
                        <ul>
                            <li>
                                <span>(1)</span>事先获得用户的明确授权或许可;
                            </li>
                            <li>
                                <span>(2)</span>遵守有关法律规定,包括在国家有关机关查询时,提供用户的注册信息、
                                用户在本站发布的信息内容及其发布时间、互联网地址或者域名等
                            </li>
                            <li>
                                <span>(3)</span>在紧急情况下竭力维护用户个人和社会大众的隐私安全;
                            </li>
                            <li>
                                <span>(4)</span>根据本条款相关规定或者我们认为必要的其他情形。终身学习网可能会
                                与第三方合作向用户提供相关的网络服务,在此情况下,如该第三方同意承担与终身学习网同
                                等的保护用户隐私的责任,则终身学习网可将用户信息提供给该第三方。
                            </li>
                        </ul>
                    </div>
                </div>
                <div class="list">
                    <div class="list-hd">
                        7.<span>所有权及知识产权条款</span>
                    </div>
                    <div class="list-bd">
                        本“网站/软件”由终身学习网拥有和运作。本“网站/软件”公开或显示的所有内容，
                        包括但不限于文字、图表、照片、图像、动画、音效、插图及软件（简称“内容”）等，
                        均属终身学习网及其许可人或内容供应商所有。本“网站/软件”内的所有组成要素，包
                        括但不限于整体设计及“内容”，均受商业外观、版权、道德规范、商标及其它所有相关
                        知识产权的法律保护。除非依据本条款与条件或与经终身学习网在其它协议的声明同意外
                        ，本网站/软件內的任何部分或组成要素或“內容”均不得以任何方式复制或传播。除非有
                        明确协议同意，否则网站/软件中的“內容”及一切相关权利将为终身学习网成员或其许可人的资产。
                    </div>
                </div>
                <div class="list">
                    <div class="list-hd">
                        8.<span>责任限制</span>
                    </div>
                    <div class="list-bd">
                        除非另有明确的书面说明,本站及其所包含的或以其它方式通过本站提供给您的全部信息、内容、
                        材料、产品(包括软件)和服务,均是在"按现状"和"按现有"的基础上提供的。除非另有明确的书
                        面说明,我们不对本站的运营及其包含在本站上的信息、内容、材料、产品(包括软件)或服务作任
                        何形式的、明示或默示的声明或担保(根据中华人民共和国法律另有规定的以外)。我们不担保本
                        站所包含的或以其它方式通过本站提供给您的全部信息、内容、材料、产品(包括软件)和服务、
                        其服务器或从本站发出的电子信件、信息没有病毒或其他有害成分。如因不可抗力或其它本站无
                        法控制的原因使本站服务系统溃或无法正常使用导致服务不可用或网上交易无法完成或丢失有关的
                        信息、记录等,我们会合理地尽力协助处理善后事宜
                    </div>
                </div>
                <div class="list">
                    <div class="list-hd">
                        9.<span>免责声明</span>
                    </div>
                    <div class="list-bd">
                        客户明确同意使用终身学习网服务的风险由客户承担。终身学习网明确表示不提供任何类型的担保，
                        不论是明确的或隐含的。终身学习网将尽力维护客户使用终身学习网服务的合法权益，但不担保终身
                        学习网服务一定能满足客户的要求，也不担保服务的及时性、安全性、真实性、稳定性、正确性。对
                        客户使用该等服务中出现的信息（包括但不限于客户发布的信息）删除或储存失败，终身学习网亦不
                        承担任何责任。
                    </div>
                    <div class="list-bd">
                        客户理解并接受下载或通过相应产品服务取得的任何信息资料取决于客户自己，并自行承担系统受损、资料丢失以及其他任何风险。
                        终身学习网对客户在互联网上得到的任何商品购物服务、交易进程、招聘信息等，都不作担保。
                    </div>
                    <div class="list-bd">
                        终身学习网对直接、间接、偶然、特殊及继起的损害不负责任，这些损害来自：不正当使用***服务及/或应用服务，在网上购买商品
                        或类似服务，在网上进行交易，非法使用服务或客户传送的信息有所变动。
                    </div>
                    <div class="list-bd">
                        终身学习网对本项服务下涉及的境内外基础运营商的通信网络的故障、技术缺陷、覆盖范围限制、不可抗力、计算机病毒、黑客攻击、
                        客户所在位置、客户关机或其他非***技术能力范围内的事因等造成的服务中断、客户邮件内容丢失、出现乱码、错误接收、无法接
                        收、迟延接收不承担责任。
                    </div>
                    <div class="list-bd">
                        终身学习网保留判定客户的行为是否符合本服务协议要求的权利，如果客户违背了本服务协议的规定，终身学习网有权中止或终止
                        相应终身学习网服务。 
                    </div>
                    <div class="list-bd">
                        转户规定：如果客户将手机号码转让给他人，请用户提前自行删除终身学习网内资料。否则，受让该号码的客户将能够查看您的客户个人数
                        据。终身学习网不承担由此引发的客户数据丢失等责任及纠纷。
                    </div>
                </div>
                <div class="list">
                    <div class="list-hd">
                        10. <span>协议更新及用户关注义务</span> 
                    </div>
                    <div class="list-bd">
                        根据国家法律法规的更新及网站运营需要,我们有权对本条款不时地进行修改,修改后的服务条款一旦
                        被张贴在本站上即生效力,并代替原来的服务条款。用户可随时登录查阅最新服务条款内容。如用户
                        不同意更新后的服务条款,应立即停止接受本站提供的服务;如用户继续使用本站提供的服务,即视为
                        同意更新后的用户协议。我们建议您在使用本站之前阅读本用户协议及本站的公告。如果本用户协
                        议中任何一条被视为废止无效或因任何理由不可执行,该条应视为可分的且并不影响任何其余协议
                        的有效性和可执行性。
                    </div>
                </div>
                <div class="list">
                    <div class="list-hd">
                        11. <span>法律管辖和适用</span> 
                    </div>
                    <div class="list-bd">
                        本用户协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区现行之有效法律。
                        如发生本服务条款的某些内容与适用之法律相抵触时,则这些条款将完全按法律规定重新解释,而其
                        它有效条款继续有效。如缔约方就本条款內容或其执行发生任何争议,双方应尽力友好协商解决;协
                        商不成时,任何一方均可向咕咚所在地的中华人民共和国大陆地区法院提起诉讼。
                    </div>
                </div>
                <div class="list">
                    <div class="list-hd">
                        12. <span>其他</span> 
                    </div>
                    <div class="list-bd">
                        我们尊重用户和消费者的合法权利,本用户协议及本站上发布的各类规则、政策、声明等其他内容,均
                        是为了更好的、更加便利的为用户和消费者提供服务。终身学习网欢迎用户和社会各界提出意见和建
                        议,我们将虚心接受并适时修改本服务条款及相关政策、规则。
                    </div>
                    <div class="list-bd">
                        您完成注册且成为终身学习网的注册用户则意味着您完全接受本用户协议,在注册之前请您再次确认
                        已知悉并完全理解本用户协议的全部内容。
                    </div>
                </div>
            </div>
        </div>
        <footer-fix> </footer-fix>
    </div>
    
</template>
<script>
export default {
    data () {
        return {
            headerIndex: '0'
        }
    }
}
</script>

<style lang="scss">
    .userAgreement{
        font-size: 14px;
        .agreement{
            width: 1200px;
            margin: 20px auto;
            .title{
                text-align: center;
                font-size: 18px;
                font-weight: bold
            }
            .tip{
                margin-top: 10px;
                text-indent:28px;
                line-height: 20px;
            }
            .con{
                .list{
                    line-height: 20px;
                    margin-top: 20px;
                    .list-hd{
                        span{
                            margin-left: 5px;
                        }
                    }
                    .list-bd{
                        margin-top: 10px;
                        text-indent: 28px;
                    }
                    .list-ft{
                        margin-top: 10px;
                        margin-left: 28px;
                        ul{
                            li{
                                span{
                                    margin-right: 5px;
                                }
                            }
                        }
                    }
                }
            }
        }
    }
</style>
